In [582]:
import pandas as pd
import numpy as np

# Series

In [583]:
dictionary = {'bmw': 'i5','audi': 'a6','volvo': 's90' }

In [584]:
cars = pd.Series(dictionary)
pd.Series(dictionary)

bmw       i5
audi      a6
volvo    s90
dtype: object

In [585]:
numpyArray = np.array((50,40,30))

In [586]:
pd.Series(numpyArray)

0    50
1    40
2    30
dtype: int32

In [587]:
myNumbers = [10,20,30,40]
myİndex = ['İndex1','İndex2','İndex3','İndex4']

In [588]:
pd.Series(data = myNumbers,index = myİndex)

İndex1    10
İndex2    20
İndex3    30
İndex4    40
dtype: int64

In [589]:
cars['bmw']

'i5'

In [590]:
carsMaxSpeed = {'bmw': 280,'audi': 260,'volvo': 220}
carsMaxSpeed = pd.Series(carsMaxSpeed)

In [591]:
carsMaxSpeed = carsMaxSpeed + carsMaxSpeed
carsMaxSpeed

bmw      560
audi     520
volvo    440
dtype: int64

# Dataframe

In [592]:
## Serilerin bir araya gelmesi ile olusur

In [593]:
data = np.random.randn(4,3)
data

array([[ 0.19255666,  0.47684925,  0.4748891 ],
       [ 0.4244346 ,  0.17493227,  1.16617491],
       [ 1.30137455, -1.26954426, -0.98067446],
       [-0.1749773 ,  0.67862559,  0.62412221]])

In [594]:
df = pd.DataFrame(data)
df

          0         1         2
0  0.192557  0.476849  0.474889
1  0.424435  0.174932  1.166175
2  1.301375 -1.269544 -0.980674
3 -0.174977  0.678626  0.624122

In [595]:
df[0]

0    0.192557
1    0.424435
2    1.301375
3   -0.174977
Name: 0, dtype: float64

In [596]:
df[0][0]

0.192556658640215

In [597]:
newDataFrame = pd.DataFrame(data,index=['İndex1','İndex2','İndex3','İndex4'],columns=['Column1','Column2','Column3'])
newDataFrame

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex2  0.424435  0.174932  1.166175
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [598]:
newDataFrame['Column1']

İndex1    0.192557
İndex2    0.424435
İndex3    1.301375
İndex4   -0.174977
Name: Column1, dtype: float64

In [599]:
newDataFrame['Column2']['İndex3']

-1.26954426383135

In [600]:
newDataFrame.iloc[1]#İndex Location

Column1    0.424435
Column2    0.174932
Column3    1.166175
Name: İndex2, dtype: float64

In [601]:
newDataFrame['Column4'] = newDataFrame['Column2'] + newDataFrame['Column3']
newDataFrame

         Column1   Column2   Column3   Column4
İndex1  0.192557  0.476849  0.474889  0.951738
İndex2  0.424435  0.174932  1.166175  1.341107
İndex3  1.301375 -1.269544 -0.980674 -2.250219
İndex4 -0.174977  0.678626  0.624122  1.302748

In [602]:
newDataFrame =newDataFrame.drop('Column4',axis=1)
newDataFrame

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex2  0.424435  0.174932  1.166175
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [603]:
newDataFrame.drop('İndex2',axis=0)##Drop metodunda kolon silerken axis belirtmeliyiz.
##İndex silerken default 0 oldugu icin belirtmek zorunda degiliz

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [604]:
newDataFrame

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex2  0.424435  0.174932  1.166175
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [605]:
newDataFrame.drop('İndex2',axis=0,inplace=True)
newDataFrame## İnplace True olursa atama yapmadan kalıcı olarak silebiliyoruz istenen data'yı

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [606]:
newDataFrame[newDataFrame < 0]

         Column1   Column2   Column3
İndex1       NaN       NaN       NaN
İndex3       NaN -1.269544 -0.980674
İndex4 -0.174977       NaN       NaN

In [607]:
newDataFrame <0

        Column1  Column2  Column3
İndex1    False    False    False
İndex3    False     True     True
İndex4     True    False    False

In [608]:
newDataFrame['Column1']>0

İndex1     True
İndex3     True
İndex4    False
Name: Column1, dtype: bool

In [609]:
newDataFrame[newDataFrame['Column1']>0]

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex3  1.301375 -1.269544 -0.980674

In [610]:
newDataFrame[newDataFrame['Column1']<0]

         Column1   Column2   Column3
İndex4 -0.174977  0.678626  0.624122

In [611]:
##İndex Change - Reindex

In [612]:
newDataFrame = pd.DataFrame(data,index=['İndex1','İndex2','İndex3','İndex4'],columns=['Column1','Column2','Column3'])
newDataFrame

         Column1   Column2   Column3
İndex1  0.192557  0.476849  0.474889
İndex2  0.424435  0.174932  1.166175
İndex3  1.301375 -1.269544 -0.980674
İndex4 -0.174977  0.678626  0.624122

In [613]:
newDataFrame.reset_index()

    index   Column1   Column2   Column3
0  İndex1  0.192557  0.476849  0.474889
1  İndex2  0.424435  0.174932  1.166175
2  İndex3  1.301375 -1.269544 -0.980674
3  İndex4 -0.174977  0.678626  0.624122

In [614]:
newİndexList = ['Number1','Number2','Number3','Number4']
newDataFrame['New İndex'] = newİndexList

In [615]:
newDataFrame.set_index('New İndex',inplace=True)

In [616]:
newDataFrame

            Column1   Column2   Column3
New İndex
Number1    0.192557  0.476849  0.474889
Number2    0.424435  0.174932  1.166175
Number3    1.301375 -1.269544 -0.980674
Number4   -0.174977  0.678626  0.624122

## Multi İndex

In [617]:
firstİndexs = ['Bmw','Bmw','Bmw','Audi','Audi','Audi']
secondİndex = ['M5','M4','M3','A6','A5','A4']
zipList = list(zip(firstİndexs,secondİndex))
zipList

[('Bmw', 'M5'),
 ('Bmw', 'M4'),
 ('Bmw', 'M3'),
 ('Audi', 'A6'),
 ('Audi', 'A5'),
 ('Audi', 'A4')]

In [618]:
jointİndexs = pd.MultiIndex.from_tuples(zipList)
jointİndexs

MultiIndex([( 'Bmw', 'M5'),
            ( 'Bmw', 'M4'),
            ( 'Bmw', 'M3'),
            ('Audi', 'A6'),
            ('Audi', 'A5'),
            ('Audi', 'A4')],
           )

In [619]:
type(jointİndexs)

pandas.core.indexes.multi.MultiIndex

In [620]:
myCarList = [[300,'50000$'],[280,'40000$'],[260,'30000$'],[250,'50000$'],[260,'40000$'],[270,'30000$']]
myCarList

[[300, '50000$'],
 [280, '40000$'],
 [260, '30000$'],
 [250, '50000$'],
 [260, '40000$'],
 [270, '30000$']]

In [621]:
carDataFrame = pd.DataFrame(myCarList,index=jointİndexs,columns=['Speed','Price'])

In [622]:
carDataFrame

         Speed   Price
Bmw  M5    300  50000$
     M4    280  40000$
     M3    260  30000$
Audi A6    250  50000$
     A5    260  40000$
     A4    270  30000$

In [623]:
carDataFrame.loc['Bmw']

    Speed   Price
M5    300  50000$
M4    280  40000$
M3    260  30000$

In [624]:
carDataFrame.loc['Audi'].loc['A6']

Speed       250
Price    50000$
Name: A6, dtype: object

In [625]:
carDataFrame.index.names = ['Mark','Model']
carDataFrame

            Speed   Price
Mark Model
Bmw  M5       300  50000$
     M4       280  40000$
     M3       260  30000$
Audi A6       250  50000$
     A5       260  40000$
     A4       270  30000$

# Missing Data

In [626]:
missData = {'Bursa':[30,29,np.nan],'İstanbul':[27,np.nan,33],'Izmir':[40,35,39]}
missData

{'Bursa': [30, 29, nan], 'İstanbul': [27, nan, 33], 'Izmir': [40, 35, 39]}

In [627]:
missData = pd.DataFrame(missData)
missData

   Bursa  İstanbul  Izmir
0   30.0      27.0     40
1   29.0       NaN     35
2    NaN      33.0     39

In [628]:
missData.dropna()

   Bursa  İstanbul  Izmir
0   30.0      27.0     40

In [629]:
missData.dropna(axis=1)

   Izmir
0     40
1     35
2     39

In [630]:
missData = {'Bursa':[30,29,np.nan],'İstanbul':[27,np.nan,33],'Izmir':[40,35,39],'Antalya':[45,np.nan,np.nan]}
missData = pd.DataFrame(missData)
missData

   Bursa  İstanbul  Izmir  Antalya
0   30.0      27.0     40     45.0
1   29.0       NaN     35      NaN
2    NaN      33.0     39      NaN

In [631]:
missData.dropna()

   Bursa  İstanbul  Izmir  Antalya
0   30.0      27.0     40     45.0

In [632]:
missData.dropna(axis=1,thresh=2)##Thresh belirtilen sayı kadar olanları drop eder

   Bursa  İstanbul  Izmir
0   30.0      27.0     40
1   29.0       NaN     35
2    NaN      33.0     39

In [633]:
missData.isnull()

   Bursa  İstanbul  Izmir  Antalya
0  False     False  False    False
1  False      True  False     True
2   True     False  False     True

In [634]:
missData.isna().sum()

Bursa       1
İstanbul    1
Izmir       0
Antalya     2
dtype: int64

In [635]:
missData.fillna(20)

   Bursa  İstanbul  Izmir  Antalya
0   30.0      27.0     40     45.0
1   29.0      20.0     35     20.0
2   20.0      33.0     39     20.0

In [636]:
missData.fillna(value=(missData.sum().sum()/(missData.size - missData.isnull().sum().sum())))

   Bursa  İstanbul  Izmir  Antalya
0  30.00     27.00     40    45.00
1  29.00     34.75     35    34.75
2  34.75     33.00     39    34.75

# Groupby

In [637]:
wageDict = {'Departmans': ["Software","Software","Journalist","Journalist","Human Resources","Human Resources"],
            "Worker":["Jack","Robert","Marianna","James","Adriana","Gabriel"],
           "Wage":[5000,4000,4500,5000,6000,6500]}

In [638]:
wageDict

{'Departmans': ['Software',
  'Software',
  'Journalist',
  'Journalist',
  'Human Resources',
  'Human Resources'],
 'Worker': ['Jack', 'Robert', 'Marianna', 'James', 'Adriana', 'Gabriel'],
 'Wage': [5000, 4000, 4500, 5000, 6000, 6500]}

In [639]:
wageDataFrame = pd.DataFrame(wageDict)
wageDataFrame

        Departmans    Worker  Wage
0         Software      Jack  5000
1         Software    Robert  4000
2       Journalist  Marianna  4500
3       Journalist     James  5000
4  Human Resources   Adriana  6000
5  Human Resources   Gabriel  6500

In [640]:
groupObject = wageDataFrame.groupby("Departmans")

In [641]:
groupObject.dtypes

                 Worker   Wage
Departmans
Human Resources  object  int64
Journalist       object  int64
Software         object  int64

In [642]:
groupObject.count()

                 Worker  Wage
Departmans
Human Resources       2     2
Journalist            2     2
Software              2     2

In [643]:
groupObject.mean()

                   Wage
Departmans
Human Resources  6250.0
Journalist       4750.0
Software         4500.0

In [644]:
groupObject.max()

                   Worker  Wage
Departmans
Human Resources   Gabriel  6500
Journalist       Marianna  5000
Software           Robert  5000

In [645]:
groupObject.min()

                  Worker  Wage
Departmans
Human Resources  Adriana  6000
Journalist         James  4500
Software            Jack  4000

In [646]:
groupObject.describe()

                 Wage                                                      \
                count    mean         std     min     25%     50%     75%
Departmans
Human Resources   2.0  6250.0  353.553391  6000.0  6125.0  6250.0  6375.0
Journalist        2.0  4750.0  353.553391  4500.0  4625.0  4750.0  4875.0
Software          2.0  4500.0  707.106781  4000.0  4250.0  4500.0  4750.0


                    max
Departmans
Human Resources  6500.0
Journalist       5000.0
Software         5000.0

# Concat

In [647]:
dict1 = {'Name': ['Ahmet','Mehmet','Zeynep','Anıl'],
         'Spor': ['Runner','Swimmer','Runner','NBA Player'],
         'Wage':[5000,6000,7000,8000]}
dict1

{'Name': ['Ahmet', 'Mehmet', 'Zeynep', 'Anıl'],
 'Spor': ['Runner', 'Swimmer', 'Runner', 'NBA Player'],
 'Wage': [5000, 6000, 7000, 8000]}

In [648]:
dict1

{'Name': ['Ahmet', 'Mehmet', 'Zeynep', 'Anıl'],
 'Spor': ['Runner', 'Swimmer', 'Runner', 'NBA Player'],
 'Wage': [5000, 6000, 7000, 8000]}

In [649]:
dict1 = pd.DataFrame(dict1,index=[0,1,2,3])
dict1

     Name        Spor  Wage
0   Ahmet      Runner  5000
1  Mehmet     Swimmer  6000
2  Zeynep      Runner  7000
3    Anıl  NBA Player  8000

In [650]:
dict2 = {'Name': ['Deniz','Ece','Aslı','Ada'],
         'Spor': ['Runner','Swimmer','Runner','NBA Player'],
         'Wage':[3000,11000,6000,4000]}
dict2 = pd.DataFrame(dict2,index=[4,5,6,7])
dict2

    Name        Spor   Wage
4  Deniz      Runner   3000
5    Ece     Swimmer  11000
6   Aslı      Runner   6000
7    Ada  NBA Player   4000

In [651]:
dict3 = {'Name': ['Ayse','Gamze','Duygu','Okan'],
         'Spor': ['Runner','Swimmer','Runner','NBA Player'],
         'Wage':[8000,4000,9000,12000]}
dict3 = pd.DataFrame(dict3,index=[8,9,10,11])
dict3

     Name        Spor   Wage
8    Ayse      Runner   8000
9   Gamze     Swimmer   4000
10  Duygu      Runner   9000
11   Okan  NBA Player  12000

In [652]:
pd.concat([dict1,dict2,dict3],axis=0)

      Name        Spor   Wage
0    Ahmet      Runner   5000
1   Mehmet     Swimmer   6000
2   Zeynep      Runner   7000
3     Anıl  NBA Player   8000
4    Deniz      Runner   3000
5      Ece     Swimmer  11000
6     Aslı      Runner   6000
7      Ada  NBA Player   4000
8     Ayse      Runner   8000
9    Gamze     Swimmer   4000
10   Duygu      Runner   9000
11    Okan  NBA Player  12000

# Merge

In [658]:
dict4 = {'Name': ['Ahmet','Mehmet','Zeynep','Anıl'],
         'Wage':[5000,6000,7000,8000]}
dict4

{'Name': ['Ahmet', 'Mehmet', 'Zeynep', 'Anıl'],
 'Wage': [5000, 6000, 7000, 8000]}

In [659]:
dict5 = {'Name': ['Ahmet','Mehmet','Zeynep','Anıl'],
         'Spor': ['Runner','Swimmer','Runner','NBA Player']}
dict5

{'Name': ['Ahmet', 'Mehmet', 'Zeynep', 'Anıl'],
 'Spor': ['Runner', 'Swimmer', 'Runner', 'NBA Player']}

In [660]:
dict4 = pd.DataFrame(dict4)
dict5 = pd.DataFrame(dict5)

In [661]:
pd.merge(dict4,dict5,on='Name')

     Name  Wage        Spor
0   Ahmet  5000      Runner
1  Mehmet  6000     Swimmer
2  Zeynep  7000      Runner
3    Anıl  8000  NBA Player

In [662]:
##Yeni veriler yada sütunlar eklemek için concat kullanabiliriz
##Ortak noktası bulunan 2 tabloyu birleştirmek için merge kullanabiliriz

 # Advanced

In [665]:
wageDict = {'Departmans': ["Software","Software","Journalist","Journalist","Human Resources","Human Resources"],
            "Worker":["Jack","Robert","Marianna","James","Adriana","Gabriel"],
           "Wage":[5000,4000,4500,5000,6000,6500]}
wageDict = pd.DataFrame(wageDict)
wageDict

        Departmans    Worker  Wage
0         Software      Jack  5000
1         Software    Robert  4000
2       Journalist  Marianna  4500
3       Journalist     James  5000
4  Human Resources   Adriana  6000
5  Human Resources   Gabriel  6500

In [671]:
wageDict['Departmans'].unique()

array(['Software', 'Journalist', 'Human Resources'], dtype=object)

In [672]:
wageDict['Departmans'].unique().size

3

In [674]:
wageDict['Departmans'].nunique()

3

In [675]:
wageDict['Departmans'].value_counts()

Software           2
Journalist         2
Human Resources    2
Name: Departmans, dtype: int64

In [678]:
def raiseWage(wage):
    return wage * 1.25

In [681]:
wageDict['Wage'].apply(raiseWage)

0    6250.0
1    5000.0
2    5625.0
3    6250.0
4    7500.0
5    8125.0
Name: Wage, dtype: float64